back-end service/app/controllers/books_controller.rb

  def index
    # aBook = Book.new
    books = Book.searchManyFields(params[:keyword], params[:page], params[:booksPerPage])

    total = Book.getTotalResults()
    due_days = DueDay.all
---
SELECT `due_days`.* FROM `due_days`

  def create
    book = Book.new(book_params)
    if book.save
---
INSERT INTO `books` (`title`, `authors`, `tags`, `is_text_book`, `book_image`, `review`, `created_at`, `updated_at`, `location`, `call_number`, `publisher`, `year_of_publication`, `due_days`) VALUES ('Keeping Your Family Strong In a World Gone Wrong', 'Dr. Kevin Leman', 'Soft skills', TRUE, '1590744-M.jpg', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam consectetur urna sapien, vitae condimentum massa ornare a. Fusce ac pulvinar nunc. Sed vehicula tempus risus et consectetur. Pellentesque id felis sit amet metus vehicula auctor non in elit. Proin feugiat tempor est, vel ullamcorper nisi. Etiam elit dui, faucibus et elit sed, bibendum vestibulum leo. Donec feugiat tincidunt elit, ac posuere ipsum dictum quis. Vivamus id pretium mauris. Aenean eu nisl id est finibus mollis. Nunc vehicula metus eget tempor facilisis. Nullam nisl justo, cursus in interdum ut, ultrices non nibh.', '2019-04-13 14:49:25', '2019-04-13 14:49:25', 'a12', '0842371125', 'Living Books', 2019, 62)

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `tags` = 'asdfasdfasdfasdfasdfasdfasdf', `call_number` = 'asdfasdfdfasdfasdfasdfasdf', `publisher` = 'asdfasdfasdfasdfasdfas', `updated_at` = '2019-04-13 14:22:11' WHERE `books`.`id` = 1

  def destroy
    begin
      book = Book.find(params[:id])
      if book.destroy
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 1