back-end service/app/controllers/tickets_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 20 LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 12 LIMIT 1
INSERT INTO `tickets` (`student_id`, `created_at`, `updated_at`) VALUES (20, '2019-04-13 15:25:47', '2019-04-13 15:25:47')
UPDATE `books` SET `available_quantity` = 98, `updated_at` = '2019-04-13 15:25:47' WHERE `books`.`id` = 12
INSERT INTO `ticket_details` (`ticket_id`, `book_id`, `due_date`, `created_at`, `updated_at`, `student_id`) VALUES (1, 12, '2019-06-14 15:25:47', '2019-04-13 15:25:47', '2019-04-13 15:25:47', 20)
---
  def create
    begin
      # validate student
      student = Student.find(params[:student_id])
      # validate books
      params[:books].each do |book|
        currentBook = Book.find(book[:id])
        if currentBook[:available_quantity] < 1
          render json: {status: 'ERROR', message: 'Invalid chosen book', data: 'There is not a book whose ID: ' + book[:id].to_s}
          #note: return here
          return
        end
      end

      # # create ticket
      ticket = Ticket.new(:student_id => params[:student_id])
      if ticket.save
        params[:books].each do |book|
          #decrease available_quantity of book, actually, just get ids in params[:books]
          currentBook = Book.find(book[:id])
          decreaseOne = currentBook[:available_quantity] - 1
          currentBook.update_attributes available_quantity: decreaseOne
          # set due_date, based on due_days of current book
          due_date = ticket[:created_at] + currentBook.due_days * 24 * 3600
          # push book to ticket details
          ticket.ticket_details.create(:book_id => book[:id], :due_date => due_date, :student_id => params[:student_id])